Repository: guntupallv/Bluecollarworkerapp
Catalog: lib/l10n/app_*.arb
Languages: te

source: Welcome
te: స్వాగతం

source: Login
te: లాగిన్

source: Select Role
te: పాత్రను ఎంచుకోండి

source: Worker
te: ఉద్యోగి

source: Employer
te: నియోజకుడు

source: Worker Dashboard
te: ఉద్యోగి డాష్‌బోర్డు

source: Confirm Logout
te: లాగ్అవుట్‌ని నిర్ధారించండి

# logoutPrompt
source: Are you sure you want to logout?
te: మీరు నిజంగా లాగ్అవుట్ కావాలనుకుంటున్నారా?

source: Cancel
te: రద్దు

source: Logout
te: లాగ్అవుట్

source: Nearby Jobs
te: సమీప ఉద్యోగాలు

# electricianJobTitle
source: Electrician Needed
te: ఎలక్ట్రిషియన్ అవసరం

# electricianJobSubtitle
source: ₹300/hour • Rajahmundry
te: ₹300/గంట • రాజమండ్రి

source: Jobs
te: ఉద్యోగాలు

source: Profile
te: ప్రొఫైల్

# appTitle
source: Local Job Finder
te: లోకల్ జాబ్ ఫైండర్

source: You are signing in as:
te: మీరు ఇలా సైన్ ఇన్ అవుతున్నారు:

source: Login with Phone
te: ఫోన్‌తో లాగిన్ అవ్వండి

# labelPhoneExample
source: Phone (e.g., +9198xxxxxx)
te: ఫోన్ (ఉదా., +9198xxxxxx)

source: Send OTP
te: OTP పంపండి

# verifyAndContinue
source: Verify & Continue
te: ధృవీకరించి కొనసాగించండి

source: Resend OTP
te: OTP మళ్లీ పంపండి

# enterOtp
source: Enter 6-digit OTP
te: 6 అంకెల OTP నమోదు చేయండి

source: OTP re-sent
te: OTP మళ్లీ పంపబడింది

# errUserNotLoggedIn
source: User not logged in.
te: వినియోగదారు లాగిన్ కాలేదు.

# errPhoneRequired
source: Phone required
te: ఫోన్ అవసరం

# errPhoneCountryCode
source: Include country code, e.g. +91...
te: దేశ కోడ్ చేర్చండి, ఉదా. +91...

# errPhoneInvalid
source: Enter valid phone number
te: సరైన ఫోన్ నంబర్ నమోదు చేయండి

# errOtpSixDigits
source: Enter the 6-digit code
te: 6 అంకెల కోడ్ నమోదు చేయండి

# errAutoSignInFailed
source: Auto sign-in failed: {error}
te: ఆటో సైన్-ఇన్ విఫలమైంది: {error}

# errRoleLocked
source: You have already signed in as {role}. Role change not allowed.
te: మీరు ఇప్పటికే {role}గా సైన్ ఇన్ అయ్యారు. పాత్ర మార్చడం అనుమతించబడదు.

source: Verify {phone}
te: {phone}ని ధృవీకరించండి

source: Job Notifications
te: ఉద్యోగ ప్రకటనలు

source: Edit Profile
te: ప్రొఫైల్ సరిచేయి

source: Job Applications
te: ఉద్యోగ అప్లికేషన్లు

source: Alerts
te: అలర్ట్స్

source: Search by title or category
te: టైటిల్ లేదా కేటగిరీ ద్వారా వెతకండి

source: Rate Type
te: రేట్ రకం

source: Sort:
te: క్రమపరచు:

# sortClosest
source: Closest
te: దగ్గరగా

# sortHighestPay
source: Highest Pay
te: అత్యధిక వేతనం

# sortNewest
source: Newest
te: కొత్తవి

# noJobsFoundMatching
source: No jobs found matching filters.
te: ఎంపికలతో సరిపడే ఉద్యోగాలు లేవు.

# locationPermissionRequired
source: Location permission required to show nearby jobs.
te: సమీప ఉద్యోగాలు చూపించడానికి స్థానం అనుమతి అవసరం.

# rateAny
source: Any
te: ఏదైనా

# ratePerHour
source: Per Hour
te: గంటకు

# ratePerDay
source: Per Day
te: రోజుకు

# ratePerWeek
source: Per Week
te: వారానికి

# ratePerMonth
source: Per Month
te: నెలకు

source: My Applications
te: నా అప్లికేషన్లు

source: No applications found.
te: అప్లికేషన్లు లేవు.

source: Loading job...
te: ఉద్యోగం లోడ్ అవుతోంది...

source: Job Details
te: ఉద్యోగ వివరాలు

source: Location
te: స్థానం

source: Category
te: కేటగిరీ

source: Rate
te: రేట్

source: Timing
te: సమయం

source: Contact
te: సంప్రదింపు

source: Description
te: వివరణ

source: Status
te: స్థితి

source: Close
te: మూసివేయి

source: Apply Now
te: ఇప్పుడు దరఖాస్తు చేయండి

source: Already Applied
te: ఇప్పటికే దరఖాస్తు చేయబడింది

source: Application submitted
te: దరఖాస్తు సమర్పించబడింది

source: Failed to launch dialer
te: డయలర్ ప్రారంభించడంలో విఫలం

# cannotLaunchDialer
source: Cannot launch dialer: No app found
te: డయలర్ ప్రారంభించలేము: అప్లికేషన్ లేదు

source: Call Employer
te: నియోక్తను కాల్ చేయండి

# noNewJobsInArea
source: No new jobs in your area.
te: మీ ప్రాంతంలో కొత్త ఉద్యోగాలు లేవు.

source: Mark as seen
te: చూసినట్లుగా గుర్తించండి

source: Profile Information
te: ప్రొఫైల్ సమాచారం

source: No profile data found.
te: ప్రొఫైల్ డేటా లేదు.

source: Name
te: పేరు

source: Skills
te: నైపుణ్యాలు

source: Experience
te: అనుభవం

source: years
te: సంవత్సరాలు

source: Expected Rate
te: అంచనా రేట్

source: Mobile Number
te: మొబైల్ నంబర్

source: Address
te: చిరునామా

source: Available Now
te: ఇప్పుడు అందుబాటులో

source: Yes
te: అవును

source: No
te: లేదు

source: ID Verification
te: ఐడి ధృవీకరణ

source: Verification Status
te: ధృవీకరణ స్థితి

source: No ID proof uploaded.
te: ఐడి రుజువు అప్లోడ్ చేయబడలేదు.

source: Setup Worker Profile
te: కార్మిక ప్రొఫైల్ సెటప్

source: Full Name
te: పూర్తి పేరు

source: Skills (comma-separated)
te: నైపుణ్యాలు (కామాలతో వేరు చేయబడినవి)

source: Experience (years)
te: అనుభవం (సంవత్సరాలు)

# expectedRateAmount
source: Expected Rate
te: అంచనా రేట్

source: Upload ID (Camera / Gallery)
te: ఐడి అప్లోడ్ చేయండి (కెమెరా / గ్యాలరీ)

source: Choose from Gallery
te: గ్యాలరీ నుండి ఎంచుకోండి

# takePhoto
source: Take a Photo
te: ఫోటో తీయండి

source: Remove Selected
te: ఎంచుకున్నది తొలగించండి

source: Save Profile
te: ప్రొఫైల్ సేవ్ చేయండి

source: Profile saved successfully
te: ప్రొఫైల్ విజయవంతంగా సేవ్ చేయబడింది

# errorSavingProfile
source: Error saving profile: {error}
te: ప్రొఫైల్ సేవ్ చేయడంలో లోపం: {error}

source: Required
te: అవసరం

source: No Title
te: టైటిల్ లేదు

source: No Description
te: వివరణ లేదు

source: Not specified
te: పేర్కొనబడలేదు

source: Not provided
te: అందించబడలేదు

source: Not Mentioned
te: పేర్కొనబడలేదు

source: No Address
te: చిరునామా లేదు

source: Per Hour
te: గంటకు

source: Per Day
te: రోజుకు

source: Per Week
te: వారానికి

source: Per Month
te: నెలకు

# applicantsForJob
source: Applicants for "{jobTitle}"
te: "{jobTitle}" కోసం దరఖాస్తుదారులు

source: No applicants yet.
te: ఇంకా దరఖాస్తుదారులు లేరు.

source: Loading...
te: లోడ్ అవుతోంది...

source: Worker profile not found.
te: కార్మిక ప్రొఫైల్ కనుగొనబడలేదు.

source: Unable to open dialer
te: డయలర్ తెరవలేము

source: Verified
te: ధృవీకరించబడింది

source: No address available
te: చిరునామా అందుబాటులో లేదు

source: ID Proof
te: ఐడి రుజువు

# ratingsAndReviews
source: Ratings & Reviews
te: రేటింగ్లు మరియు సమీక్షలు

source: No reviews yet.
te: ఇంకా సమీక్షలు లేవు.

# averageRating
source: ⭐ Average Rating: {rating} ({count} reviews)
te: ⭐ సగటు రేటింగ్: {rating} ({count} సమీక్షలు)

source: Rate Worker
te: కార్మికుడిని రేట్ చేయండి

# ratingLabel
source: Rating (1.0 - 5.0)
te: రేటింగ్ (1.0 - 5.0)

source: Comment
te: వ్యాఖ్య

source: Submit
te: సమర్పించండి

# enterValidRating
source: Enter a valid rating (1.0 to 5.0)
te: చెల్లుబాటు అయ్యే రేటింగ్ నమోదు చేయండి (1.0 నుండి 5.0)

source: Review submitted
te: సమీక్ష సమర్పించబడింది

source: Accept
te: అంగీకరించండి

source: Reject
te: తిరస్కరించండి

source: PENDING
te: పెండింగ్

source: ACCEPTED
te: అంగీకరించబడింది

source: REJECTED
te: తిరస్కరించబడింది

# rateWorkerButton
source: Rate Worker
te: కార్మికుడిని రేట్ చేయండి

source: Unnamed
te: పేరు లేని

# skillsLabel
source: Skills: {skills}
te: నైపుణ్యాలు: {skills}

# experienceLabel
source: Experience: {experience} yrs
te: అనుభవం: {experience} సంవత్సరాలు

source: Employer Dashboard
te: నియోక్త డాష్‌బోర్డ్

source: Favorite Workers
te: ఇష్టమైన కార్మికులు

source: Employer Profile
te: నియోక్త ప్రొఫైల్

source: Your Job Posts
te: మీ ఉద్యోగ పోస్ట్లు

source: No job posts yet.
te: ఇంకా ఉద్యోగ పోస్ట్లు లేవు.

# posted
source: Posted: {date}
te: పోస్ట్ చేయబడింది: {date}

source: Untitled
te: శీర్షిక లేని

source: Post Job
te: ఉద్యోగం పోస్ట్ చేయండి

source: Nearby Workers
te: సమీప కార్మికులు

source: Post a Job
te: ఉద్యోగం పోస్ట్ చేయండి

source: Job Title
te: ఉద్యోగ శీర్షిక

source: Job Category
te: ఉద్యోగ వర్గం

# contactMobileNumber
source: Contact Mobile Number(+91 or +44)
te: సంప్రదింపు మొబైల్ నంబర్(+91 లేదా +44)

source: Job Timing:
te: ఉద్యోగ సమయం:

source: Job Description
te: ఉద్యోగ వివరణ

# pleaseFillAllFields
source: Please fill all fields and set job timing
te: దయచేసి అన్ని ఫీల్డ్లను నింపండి మరియు ఉద్యోగ సమయాన్ని సెట్ చేయండి

source: Job posted successfully!
te: ఉద్యోగం విజయవంతంగా పోస్ట్ చేయబడింది!

# error
source: Error: {message}
te: లోపం: {message}

source: Not Set
te: సెట్ చేయబడలేదు

source: Start Time
te: ప్రారంభ సమయం

source: End Time
te: ముగింపు సమయం

source: Fetching current location...
te: ప్రస్తుత స్థానాన్ని పొందుతోంది...

source: Location fetch failed
te: స్థానాన్ని పొందడంలో విఫలం

source: Business Type
te: వ్యాపార రకం

source: Company
te: కంపెనీ

source: Setup Employer Profile
te: నియోక్త ప్రొఫైల్ సెటప్

source: Company Name (optional)
te: కంపెనీ పేరు (ఐచ్ఛికం)

source: Employer profile saved
te: నియోక్త ప్రొఫైల్ సేవ్ చేయబడింది

# errorSavingEmployerProfile
source: Error saving profile: {error}
te: ప్రొఫైల్ సేవ్ చేయడంలో లోపం: {error}

source: No Name
te: పేరు లేదు

source: Not Verified
te: ధృవీకరించబడలేదు

# rateTypeLabel
source: Rate Type: {rateType}
te: రేట్ రకం: {rateType}

# expectedRateLabel
source: Expected Rate: {rate}
te: అంచనా రేట్: {rate}

# availableNowLabel
source: Available Now: {available}
te: ఇప్పుడు అందుబాటులో: {available}

source: Tap image to view full size
te: పూర్తి పరిమాణం చూడటానికి చిత్రంపై నొక్కండి

source: No ID uploaded.
te: ఐడి అప్లోడ్ చేయబడలేదు.

source: No favorite workers.
te: ఇష్టమైన కార్మికులు లేరు.

# searchBySkills
source: Search by Skills (comma separated)
te: నైపుణ్యాల ద్వారా వెతకండి (కామాలతో వేరు చేయబడినవి)

source: No workers found nearby.
te: సమీపంలో కార్మికులు లేరు.

source: Mobile
te: మొబైల్

source: View ID
te: ఐడి చూడండి

source: Unfavorite
te: ఇష్టమైనది కాదు

source: Favorite
te: ఇష్టమైనది

source: Delete Job
te: ఉద్యోగం తొలగించండి

# deleteJobConfirmation
source: Are you sure you want to delete this job post?
te: మీరు నిజంగా ఈ ఉద్యోగ పోస్ట్‌ని తొలగించాలనుకుంటున్నారా?

source: Delete
te: తొలగించండి

source: Job deleted
te: ఉద్యోగం తొలగించబడింది

source: Edit
te: సరిచేయి

source: Job not found
te: ఉద్యోగం కనుగొనబడలేదు

source: Title
te: శీర్షిక

source: Job Timings
te: ఉద్యోగ సమయాలు

source: No Timings Mentioned
te: సమయాలు పేర్కొనబడలేదు

source: Contact Number
te: సంప్రదింపు నంబర్

source: No description provided.
te: వివరణ అందించబడలేదు.

# postedAt
source: Posted at: {date}
te: పోస్ట్ చేయబడింది: {date}

source: View Applicants
te: దరఖాస్తుదారులను చూడండి

source: Untitled Job
te: శీర్షిక లేని ఉద్యోగం

source: Edit Job
te: ఉద్యోగం సరిచేయి

# pleaseCompleteAllFields
source: Please complete all fields and job timing
te: దయచేసి అన్ని ఫీల్డ్లు మరియు ఉద్యోగ సమయాన్ని పూర్తి చేయండి

source: Job updated successfully!
te: ఉద్యోగం విజయవంతంగా అప్డేట్ చేయబడింది!

# updateFailed
source: Update failed: {error}
te: అప్డేట్ విఫలం: {error}

source: Contact Mobile
te: సంప్రదింపు మొబైల్

source: Update Job
te: ఉద్యోగం అప్డేట్ చేయండి
